NDJSec/FALCON/knowledge_base/svd/data/Freescale/MKV56F24.svd
        <register>
          <name>BFAR</name>
          <description>BusFault Address Register</description>
          <addressOffset>0xD38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>Address of the BusFault location</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AFSR</name>
          <description>Auxiliary Fault Status Register</description>
          <addressOffset>0xD3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AUXFAULT</name>
              <description>Latched version of the AUXFAULT inputs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_PFR0</name>
          <description>Processor Feature Register 0</description>
          <addressOffset>0xD40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STATE0</name>
              <description>ARM instruction set support</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>ARMv7-M reserved</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ARMv7-M reserved</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>ARMv7-M reserved</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Support for Thumb encoding including Thumb-2 technology, with all basic 16-bit and 32-bit instructions.</description>
                  <value>#0011</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATE1</name>
              <description>Thumb instruction set support</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The processor does not support the ARM instruction set.</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ARMv7-M reserved</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATE2</name>
              <description>ARMv7-M reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATE3</name>
              <description>ARMv7-M reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_PFR1</name>
          <description>Processor Feature Register 1</description>
          <addressOffset>0xD44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PROGMODEL</name>
              <description>M profile programmers&apos; model</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>ARMv7-M reserved</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Two-stack programmers&apos; model supported</description>
                  <value>#0010</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_DFR0</name>
          <description>Debug Feature Register</description>
          <addressOffset>0xD48</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DEBUGMODEL</name>
              <description>Support for memory-mapped debug model for M profile processors</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Not supported</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Support for M profile Debug architecture, with memory-mapped access.</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_AFR0</name>
          <description>Auxiliary Feature Register</description>
          <addressOffset>0xD4C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IMPLEMENTATION_DEFINED0</name>
              <description>Gives information about the IMPLEMENTATION DEFINED features of a processor implementation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IMPLEMENTATION_DEFINED1</name>
              <description>Gives information about the IMPLEMENTATION DEFINED features of a processor implementation.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IMPLEMENTATION_DEFINED2</name>
              <description>Gives information about the IMPLEMENTATION DEFINED features of a processor implementation.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IMPLEMENTATION_DEFINED3</name>
              <description>Gives information about the IMPLEMENTATION DEFINED features of a processor implementation.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_MMFR0</name>
          <description>Memory Model Feature Register 0</description>
          <addressOffset>0xD50</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PMSASUPPORT</name>
              <description>Indicates support for a PMSA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Not supported</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ARMv7-M reserved</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>ARMv7-M reserved</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>PMSAv7, providing support for a base region and subregions.</description>
                  <value>#0011</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTERMOST_SHAREABILITY</name>
              <description>Indicates the outermost shareability domain implemented</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Implemented as Non-cacheable</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ARMv7-M reserved</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>ARMv7-M reserved</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>ARMv7-M reserved</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>ARMv7-M reserved</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>ARMv7-M reserved</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>ARMv7-M reserved</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>ARMv7-M reserved</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>ARMv7-M reserved</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>ARMv7-M reserved</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>ARMv7-M reserved</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>ARMv7-M reserved</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>ARMv7-M reserved</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>ARMv7-M reserved</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>ARMv7-M reserved</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>Shareability ignored.</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHAREABILITY_LEVELS</name>
              <description>Indicates the number of shareability levels implemented</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>One level of shareability implemented</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ARMv7-M reserved</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCM_SUPPORT</name>
              <description>Indicates the support for Tightly Coupled Memory</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No tightly coupled memories implemented.</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Tightly coupled memories implemented with IMPLEMENTATION DEFINED control.</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>ARMv7-M reserved</description>
                  <value>#0010</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUXILIARY_REGISTERS</name>
              <description>Indicates the support for Auxiliary registers</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Not supported</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Support for Auxiliary Control Register only.</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>ARMv7-M reserved</description>
                  <value>#0010</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_MMFR1</name>
          <description>Memory Model Feature Register 1</description>
          <addressOffset>0xD54</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ID_MMFR1</name>
              <description>Gives information about the implemented memory model and memory management support.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_MMFR2</name>
          <description>Memory Model Feature Register 2</description>
          <addressOffset>0xD58</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WFI_STALL</name>
              <description>Indicates the support for Wait For Interrupt (WFI) stalling</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Not supported</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Support for WFI stalling</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_MMFR3</name>
          <description>Memory Model Feature Register 3</description>
          <addressOffset>0xD5C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ID_MMFR3</name>
              <description>Gives information about the implemented memory model and memory management support.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
